[
  {
    "domain": "content_writing",
    "questions": [
      "What does content writing mean to you and how do you think it fits within a technical club?",
      "How do you ensure the accuracy and credibility of the information you write about?",
      "Describe a time when you had to write about a technical topic that you were not familiar with. How did you approach the task?",
      "How do you handle tight deadlines while maintaining the quality of your content?",
      "Can you share any prior experience related to content writing, especially within the technical field?",
      "How do you tailor your writing style to engage a diverse audience, from technical experts to casual readers?",
      "Describe a situation where your content significantly impacted a project's success or a community's engagement.",
      "Rate your research skills out of 10 and state why."
    ]
  },
  {
    "domain": "vfx",
    "questions": [
      "What excites you about working with VFX, and how do you think it enhances the club's content?",
      "Can you describe a project where you successfully integrated VFX to improve the overall visual experience?",
      "How do you keep up with the latest trends and techniques in the field of VFX?",
      "How would you approach creating a VFX sequence with limited resources or budget?",
      "Describe a time when you had to collaborate with others (e.g., content creators, graphic designers) on a VFX project. How did you ensure smooth communication and workflow?",
      "How do you balance creativity and technical skills when working on VFX projects?",
      "If you had to create a promotional video for an upcoming club event, what VFX elements would you consider including and why?",
      "Rate your problem-solving skills when it comes to technical challenges in VFX out of 10 and state why."
    ]
  },
  {
    "domain": "gfx",
    "questions": [
      "What inspired you to pursue graphic design, and how do you think your skills can benefit the club?",
      "How do you ensure your designs communicate the intended message effectively?",
      "Can you describe a situation where you had to create a design under time pressure? How did you manage it?",
      "What tools or software do you primarily use for graphic design, and why do you prefer them?",
      "How do you stay updated with the latest design trends, and how do you incorporate them into your work?",
      "Describe a time when you had to incorporate feedback from multiple sources into a design. How did you prioritize the feedback and execute the final design?",
      "If you had to design promotional material for a club event, how would you approach the task, and what elements would you focus on?",
      "Rate your creativity and adaptability out of 10 and state why."
    ]
  },
  {
    "domain": "technical",
    "questions": [
      "What technical skills or knowledge do you bring to the club, and how do you think they can be utilized?",
      "Describe a challenging technical problem you faced and how you solved it.",
      "How do you stay updated with the latest developments and technologies in your field?",
      "Explain a technical project you worked on, detailing your role and the technologies used.",
      "How do you approach debugging and troubleshooting issues in a technical project?",
      "How do you prioritize tasks and manage your time when working on multiple technical projects?",
      "If you had to introduce a new technology or tool to the club, how would you go about it?",
      "Rate your problem-solving skills in technical scenarios out of 10 and state why."
    ]
  },
  {
    "domain": "technicalp",
    "questions": [
      "Project slug",
      "Project Name",
      "Github Repo Link",
      "Preferred Domain"
    ]
  }
]
